-- Скрипт для блимання світлодіодом на 13 піні.

BTN_EXIT = 0 -- Пін кнопки виходу.

pin.output(13) -- Налаштувати 13 пін на вихід.

function update()
    if input.is_pressed(BTN_EXIT) then -- Обробка кнопки виходу.
        input.lock(BTN_EXIT, 1000) -- Заблокувати спрацьовування кнопки на n мс.
        pin.input(13) -- Перевести пін перед виходом зі скрипта у високоімпедансний стан.
		context.exit() -- Завершити роботу скрипта.
        return;
	end

    pin.toggle(13) -- Змінити стан піна на протилежний.
    mcu.sleep(1000) -- Сон МК в мс. Час сну повинен бути меншим за час спрацювання watchdog-таймера.
end