-- Скрипт для налаштування виходу ШІМ на 12 піні МК.

BTN_EXIT = 0 -- Пін кнопки виходу.

pwm = require("pwm") -- Підключити модуль pwm в скрипт.

pwm.setup(0, 3000, 8) -- Налаштувати pwm (канал, частота, розрядність).

pwm.attach(12, 0) -- Приєднати 12-й пін до 0-вого каналу pwm.

pwm.set(0, 20) -- Встановити 20% заповнення для 0-вого каналу.

function update()
    if input.is_pressed(BTN_EXIT) then -- Обробка кнопки виходу.
        input.lock(BTN_EXIT, 1000) -- Заблокувати спрацьовування кнопки на n мс.
        pwm.detach(12, 0) -- Відключити пін від каналу ШІМ.
        pwm.stop(0) -- Зупинити генерацію ШІМ для 0-вого каналу.
		context.exit() -- Завершити роботу скрипта.
        return;
	end
end