#include "ImageItem.h"

ImageItem::ImageItem(uint16_t widget_ID, GraphicsDriver &display) : Label(widget_ID, display) {}

ImageItem::~ImageItem()
{
    //-------------------------------------------------------------------- Звільнити ресурси

    if (_image) // Припускається, що якщо встановлено один віджет, то інший також
    {
        delete _image;
        delete _label;
    }
}

void ImageItem::onDraw()
{
    if (!_is_changed)
    {
        if (!_is_ticker && !(_is_ticker_in_focus && _has_focus) || _visibility == INVISIBLE)
            return;
        else if ((millis() - _last_time_ticker_update) < TICKER_UPDATE_DELAY)
            return;
        else
            _last_time_ticker_update = millis();

        _label->onDraw(); // Відмальовуємо тільки label, якщо текст потрібно прокручувати, але сам елемент не було змінено
        return;
    }

    _is_changed = false;

    if (_temp_is_ticker_in_focus && !_has_focus)
        _first_draw_char_pos = 0;

    // if (_visibility == INVISIBLE) // Ця частина непотрібна. Елемент меню не повинен бути прихованим. Для інших типів віджетів, це може бути потрібно.
    // {
    //     hide();
    //     return;
    // }

    clear(); // Залити фон

    if (!_image) // Віджети зображення та тексту не встановлено
        return;

    // Встановлюємо ЛОКАЛЬНІ координати віджетів зображення та тексту.
    // Стандартні віджети позиціонуються відносно свого контейнера.
    // При розробці власних віджетів дотримуйтесь такого ж підходу.
    //
    _image->setPos(5, (_height - _image->getHeight()) * 0.5); // Очікується, що висота зображення буде меншою за висоту контейнера

    _label->setPos(5 + 32 + 5, (_height - _label->getHeight()) * 0.5); /*
                                                                        * В даному прикладі для простоти вважається, що зображення матиме розміри 32*32, тож від його ширини розраховується позиція тексту.
                                                                        * Формула: 1пкс ширина рамки контейнера + 1пкс відступ від рамки + 32пкс ширина зображення + 5пкс відступ зправа.
                                                                        */

    _label->setWidth(_width - 18 - 32); // Підганяємо ширину Label таким чином, щоб він не виходив за межі елементу.

    if (_has_focus) // Якщо фокус встановлено на елементі, передати його також вкладеній міткі
        _label->setFocus();
    else
        _label->removeFocus();

    // Коли віджети налаштовано під розміри контейнера, викликаємо їх перемальовування.
    // Якщо віджети не змінюються, але потрібна їх перерисовка, тоді можна викликати IWidget->forceDraw()
    _image->onDraw();
    _label->onDraw();
}

ImageItem *ImageItem::clone(uint16_t id) const
{
    ImageItem *clone = new ImageItem(*this); // Поверхневе копіювання

    if (!clone) // Завжди необхідно перевіряти результат
    {
        log_e("Помилка клонування");
        esp_restart();
    }

    clone->_id = id;

    if (_image) // Якщо віджети було встановлено, робимо глибоку копію
    {
        Image *img = _image->clone(_image->getID()); //  Результат можна не перевіряти. У стандартних віджетах вже реалізовано цю перевірку.
        Label *lbl = _label->clone(_label->getID());
        clone->setWidgets(img, lbl); // Замінити вказівники, отримані при поверхневому копіюванні скопійованими об'єктами.
    }

    return clone;
}

void ImageItem::setWidgets(Image *img, Label *lbl)
{
    // Якщо викликати цей метод декілька разів для одного і того ж об'єкта, отримаємо витік пам'яті.
    // Обирайте самі, потрібно вам котролювати цей процес, чи будете тримати це в голові і не робити дурниці=)

    _image = img;
    _label = lbl;

    _image->setParent(this); // Вкладеним віджетам необхідно завжди вказувати батьківський контейнер для їх коректного позиціонування на екрані.
    _label->setParent(this);

    // Встановити прапор, який буде використовуватись при малюванні і вказуватиме, що віджет було змінено.
    // В даному випадку в ньому немає сенсу, тому що очікується, що метод викликається тільки при створенні віджету, але про цей прапор варто знати і пам'ятати.
    _is_changed = true;
}