/*
 * Приклад створення користувацького віджету(Елемент списку меню з зображенням).
 * Опис синтаксису пропущено. Очікується, що ви знаєте, як працює механізм наслідування в С++.
 */

#pragma once
#include <Arduino.h>

#include "meow/ui/widget/image/Image.h"
#include "meow/ui/widget/text/Label.h"

using namespace meow;

/*
 * Даний приклад віджету створено виключно в навчальних цілях.
 * Його можна було б реалізувати на основі макета, який передавався би в якості елемента списку меню.
 * В одному з наступних прикладів буде реалізований саме такий віджет.
 *
 * -----------------------------------------------------------------------
 *
 * Користувацький віджет повинен наслідуватияся від IWidget або його нащадка.
 * В даному випадку наслідування йде від Label, тому що в деяких випадках меню очікує саме його в якості елемента списку.
 * Мається на увазі виклик методу String getCurrentItemText() const; для меню.
 */

class ImageItem : public Label
{
public:
    //-------------------------------------------------------------------- Методи, які необхідно обов'язково реалізувати за прикладом.

    ImageItem(uint16_t widget_ID, GraphicsDriver &display);
    virtual ~ImageItem();
    virtual void onDraw() override;
    ImageItem *clone(uint16_t id) const override;

    //-------------------------------------------------------------------- Користувацькі методи

    // Користувацький віджет буде приймати вказівник на створені Image та Label.
    // Завдяки цьому не потрібно реалізовувати з самого початку відрисовку тексту та зображення.
    void setWidgets(Image *img, Label *lbl);

    // Метод не обов'язковий, але рекомендується до реалізіції, через те, що меню має метод  String getCurrentItemText() const;
    // Такі деталі потрібно тримати на увазі.
    inline String getText() const { return _label->getText(); }

private:
    // Приховуємо батьківські методи для того, щоб перевизначити їх власною реалізацією
    // Або для приховування непотрібного функціоналу
    using IWidget::setVisibility;
    using Label::getText;
    using Label::setText;

    Image *_image{nullptr}; // Віджет буде містити зображення
    Label *_label{nullptr}; // Віджет буде містити текст
};