#pragma once

#define GRAPHICS_ENABLED // Увімкнути підтримку графічного драйвера. Закоментуй, якщо в проєкті не використовується дисплей.

#define DISPLAY_ROTATION 3 // Стартова орієнтація екрану

#define DOUBLE_BUFFERRING // Подвійна буферизація. Працює тільки за наявності PSRAM. Інакше буде викликано рестарт МК

// #define SHOW_FPS // Відображати значення FPS на дисплеї

#define UI_UPDATE_DELAY 20 // Затримка (мс) між фреймами

// -------------------------------- Глибина кольору зображення
#define COLOR_16BIT
// #define COLOR_8BIT
// #define COLOR_1BIT

// #define ENABLE_SCREENSHOTER // Увімкнути підтримку створення скриншотів. Тримай закоментованим, якщо не використовується
