#pragma once

// -------------------------------- Подвійна буферизація. Працює тільки за наявності PSRAM. Інакше буде викликано рестарт МК
#define DOUBLE_BUFFERRING

// -------------------------------- Відображати значення FPS на дисплеї
// #define SHOW_FPS

// -------------------------------- Глибина кольору зображення
#define COLOR_16BIT
// #define COLOR_8BIT
// #define COLOR_1BIT

// -------------------------------- Увімкнути підтримку створення скриншотів. Тримай закоментованим, якщо не використовується
// #define ENABLE_SCREENSHOTER
